#pragma once
// ----------------------------------------------------------------------------------------------

#include "Defines.h"
#include "Import.h"
// ----------------------------------------------------------------------------------------------

#define INTERFACE_DEBUG		0
#define MAX_WINDOW_EX		100
#define MAX_BG_WIDTH		230
// ----------------------------------------------------------------------------------------------

enum ObjectID
{
	eTIME = 1,
	eRageSystem,
	eRageTable,
	eRageClose,
	eRagePointTable,
	eRageIcon1,
	eRageIcon2,
	eRageIcon3,
	eRageIcon4,
	eRageIcon5,
	eRageIcon6,
	eRageIcon7,
	eRageIcon8,
	eRageIcon9,
	eRageIcon10,
	eRageIcon11,
	eRageIcon12,
	eRageIcon13,
	eRageIcon14,
	eRageIcon15,
	eRageIcon16,
	eRageIcon17,
	eRageIcon18,
	eRageIcon19,
	eRageIcon20,
	eRageIcon21,
	eRageIcon22,
	eRageIcon23,
	eRageIcon24,
	eRageIcon25,
	eRageIcon26,
	eRageIcon27,
	eRageIcon28,
	eRageIcon29,
	eRageIcon30,
	eRageIcon31,
	eRageIcon32,
	eRageIcon33,
	eRageIcon34,
	eRageIcon35,
	eRageTeleport,
	eRagePet,
	eRageReset,
	eJewelsBank,
	//---
	eRESET_DIV,
	// ----
	eMQUEST_MAIN,
	eMQUEST_TITLE,
	eMQUEST_FRAME,
	eMQUEST_FOOTER,
	eMQUEST_DIV,
	eMQUEST_CLOSE,
	eMQUEST_INFOBG,
	eMQUEST_INFOBG2,
	eMQUEST_MONEYBG,
	eMQUEST_FINISH,
	eMQUEST_COUNT,
	// ----
	ePT_SEARCH_USER_MAIN,
	ePT_SEARCH_USER_TITLE,
	ePT_SEARCH_USER_FRAME,
	ePT_SEARCH_USER_FOOTER,
	ePT_SEARCH_USER_DIV,
	ePT_SEARCH_USER_CLOSE,
	ePT_SEARCH_USER_FINISH,
	ePT_SEARCH_USER_L,
	ePT_SEARCH_USER_R,
	ePT_SEARCH_USER_INFO,

	eImgID_ACHIEVEMENTS_MISSION_1,
	eImgID_ACHIEVEMENTS_MISSION_2,
	eImgID_ACHIEVEMENTS_MISSION_3,
	eImgID_ACHIEVEMENTS_MISSION_4,
	eImgID_ACHIEVEMENTS_MISSION_5,
	eImgID_ACHIEVEMENTS_MISSION_6,
	eImgID_ACHIEVEMENTS_MISSION_7,
	eImgID_ACHIEVEMENTS_MISSION_8,
	eImgID_ACHIEVEMENTS_MISSION_9,
	eImgID_ACHIEVEMENTS_MISSION_10,
	eImgID_ACHIEVEMENTS_MISSION_11,
	eImgID_ACHIEVEMENTS_MISSION_12,
	eImgID_ACHIEVEMENTS_MISSION_13,
	eImgID_ACHIEVEMENTS_MISSION_14,
	eImgID_ACHIEVEMENTS_MISSION_15,
	eImgID_ACHIEVEMENTS_MISSION_16,
	eImgID_ACHIEVEMENTS_MISSION_17,
	eImgID_ACHIEVEMENTS_MISSION_18,
	eImgID_ACHIEVEMENTS_MISSION_19,
	eImgID_ACHIEVEMENTS_MISSION_20,
	eImgID_ACHIEVEMENTS_MISSION_21,
	eImgID_ACHIEVEMENTS_MISSION_22,
	eImgID_ACHIEVEMENTS_MISSION_23,
	eImgID_ACHIEVEMENTS_MISSION_24,
	eImgID_ACHIEVEMENTS_MISSION_25,
	eImgID_ACHIEVEMENTS_MISSION_26,
	eImgID_ACHIEVEMENTS_MISSION_27,
	eImgID_ACHIEVEMENTS_MISSION_28,
	eImgID_ACHIEVEMENTS_MISSION_29,
	eImgID_ACHIEVEMENTS_MISSION_30,
	eImgID_ACHIEVEMENTS_MISSION_31,
	eImgID_ACHIEVEMENTS_MISSION_32,
	eImgID_ACHIEVEMENTS_MISSION_33,
	eImgID_ACHIEVEMENTS_MISSION_34,
	eImgID_ACHIEVEMENTS_MISSION_35,
	eImgID_ACHIEVEMENTS_MISSION_36,
	eImgID_ACHIEVEMENTS_MISSION_37,
	eImgID_ACHIEVEMENTS_MISSION_38,
	eImgID_ACHIEVEMENTS_MISSION_39,
	eImgID_ACHIEVEMENTS_MISSION_40,
	eImgID_ACHIEVEMENTS_MISSION_41,
	eImgID_ACHIEVEMENTS_MISSION_42,
	eImgID_ACHIEVEMENTS_MISSION_43,
	eImgID_ACHIEVEMENTS_MISSION_44,
	eImgID_ACHIEVEMENTS_MISSION_45,
	eImgID_ACHIEVEMENTS_MISSION_46,
	eImgID_ACHIEVEMENTS_MISSION_47,
	eImgID_ACHIEVEMENTS_MISSION_48,
	eImgID_ACHIEVEMENTS_MISSION_49,
	eImgID_ACHIEVEMENTS_MISSION_50,
	eImgID_ACHIEVEMENTS_PANEL,
	eImgID_ACHIEVEMENTS_DAMAGE,
	eImgID_ACHIEVEMENTS_DEFENCE,
	eImgID_ACHIEVEMENTS_LIFE,
	eImgID_ACHIEVEMENTS_EXELENT,
	eImgID_ACHIEVEMENTS_CRITICAL,
	ex_EXTELEPORT_TITLE,
	ex_PLAYERTITLE_A,
	ex_BORDER_REFFERAL,
	ex_ICON_REFFERAL,
	ex_SMITHY_ITEM,
	ex_AUTOHP_ON,
	ex_AUTOHP_OFF,
	ex_PLAYER_POINT,
	ex_NULL_MAP,
	ex_LORENCIA_MAP,
	ex_DUNGEON_MAP,
	ex_DEVIAS_MAP,
	ex_NORIA_MAP,
	ex_LOSTTOWER_MAP,
	ex_ATLANS_MAP,
	ex_Tarkan_MAP,
	ex_Elbeland_MAP,
	ex_ICARUS_MAP,
	ex_LANDOFTRIALS_MAP,
	ex_AIDA_MAP,
	ex_CRYWOLF_MAP,
	ex_KANTRU_MAP,
	ex_KANTRU3_MAP,
	ex_BARRACKS_MAP,
	ex_CALMNESS_MAP,
	ex_RAKLION_MAP,
	ex_VULCANUS_MAP,
	ex_KALRUTAN_MAP,
	ex_KALRUTAN2_MAP,
	ex_INFO_2,
	ex_TEXT_BOX3,
	ex_WAREHOUSE,
	ex_WAREHOUSE1,

	ex_LOTTERY_SPIN,
	ex_LOTTERY_CLOSE,

	ex_ITEM_MARKET_BG,
	ex_ITEM_MARKET_BUY0,
	ex_ITEM_MARKET_BUY1,
	ex_ITEM_MARKET_BUY2,
	ex_ITEM_MARKET_PAGE0,
	ex_ITEM_MARKET_PAGE1,
	ex_ITEM_MARKET_PAGE2,
	ex_ITEM_MARKET_PAGE3,
	ex_ITEM_MARKET_PAGE4,
	ex_ITEM_MARKET_PAGE5,

#if(DEV_INTERFASE_SEASON3)
	iNewSkillBox,
	iDragonLeft,
	iDragonRight,
	iNewParty,
	iNewCharacter,
	iNewInventory,
	iNewWinpush,
	iNewFastMenu,
	iNewGuild,
#endif

	ex_EXMENU3_BUTTON_01,
	ex_EXMENU3_BUTTON_02,

	#if(USERPANEL)
	ex_USERSPANELBG,
	ex_USERSPANEL_BUTTON,
	#endif
};
// ----------------------------------------------------------------------------------------------

struct ItemBmdStruct
{
    char Name[30];
/*+30*/ BYTE TwoHand;
/*+31*/ BYTE gap01;
/*+32*/ BYTE ItemLvl;
/*+33*/ BYTE gap02;
/*+34*/ BYTE Slot;
/*+35*/ BYTE gap03;
/*+36*/ BYTE Skill;
/*+37*/ BYTE gap04;
/*+38*/ BYTE ItemWidth;
/*+39*/ BYTE ItemHeight;
/*+40*/ BYTE MinDmg;
/*+41*/ BYTE MaxDmg;
/*+42*/ BYTE gap05;
/*+43*/ BYTE Defence;
/*+44*/ BYTE gap06;
/*+45*/ BYTE Speed;
/*+46*/ BYTE gap07;
/*+47*/ BYTE Dur;
/*+48*/ BYTE MagicDur;
/*+49*/ BYTE MagicPwr;
/*+50*/ BYTE ReqStr;
/*+51*/ BYTE ReqStrValue;
/*+52*/ BYTE ReqAgi;
/*+53*/ BYTE ReqAgiValue;
/*+54*/ BYTE ReqEne;
/*+55*/ BYTE ReqEneValue;
/*+56*/ BYTE ReqVit;
/*+57*/ BYTE ReqVitValue;
/*+58*/ BYTE ReqCmd; //ReqCmd = ReqCmd+(ReqCmdValue*256)
/*+59*/ BYTE ReqCmdValue;
/*+60*/ BYTE ReqLvl;
/*+60*/ byte gap08[3];
/*+63*/ unsigned int Money;
/*+67*/ BYTE Type;
/*+68*/ BYTE DW;
/*+69*/ BYTE DK;
/*+70*/ BYTE ELF;
/*+71*/ BYTE MG;
/*+72*/ BYTE DL;
/*+73*/ BYTE Sum;
/*+74*/ BYTE RF;
    BYTE Resists[8];
};
// ----------------------------------------------------------------------------------------------

enum ObjWindow // -> Season 6.3
{
	FriendList		= 1,
	MoveList		= 2,
	Party			= 3,
	Quest			= 4,//
	QuestDevin		= 5,//
	Guild			= 6,
	Trade			= 7,
	Warehouse		= 8,
	ChaosBox		= 9,
	CommandWindow	= 10,
	PetInfo			= 11,
	Shop			= 12,
	Inventory		= 13,
	Store			= 14,
	OtherStore		= 15,
	Character		= 16,
	DevilSquery		= 19,//
	BloodCastle		= 20,//
	GuildMaster		= 21,
	GuardNPC		= 24,//
	VorotaCS		= 25,//
	ChatWindow		= 33,
	FastMenu		= 34,
	Options			= 35,
	Help			= 36,
	FastDial		= 39,
	SkillTree		= 57,
	Rena			= 59,//
	LuckyCoins		= 60,//?
	LuckCoinsNPC	= 61,
	Titus			= 62,//
	NPC_Titus		= 63,
	CashShop		= 65,
	ElfQuest		= 68,
	FullMap			= 72,
	NPC_Dialog		= 73,
	GensInfo		= 74,
	NPC_Julia		= 75,
	ExpandInventory	= 77,
	ExpandWarehouse	= 78, 
	Helper			= 79,
};
